[
    {
        "id": 1,
        "name":"Portfolio Website",
        "institution":"Personal Project",
        "start":"Mar 2021",
        "end":"Oct 2021",
        "imagePath":"vue.png",
        "description":"My personal portfolio website, which is built with Vue.js, HTML, and custom CSS. It is hosted on Amazon Web Services using the Amplify console and contains all of my professional information. In the future, I am also planning to build a backend for it, which will be based on Node.js/Express.js and hosted in AWS EC2. The GitHub repository can be viewed <a target=\"_blank\" href=\"https://github.com/mkeen31/portfolio-site\">here</a>."
    },
    {
        "id": 2,
        "name":"Undergraduate Capstone Project",
        "institution":"Ball State University",
        "start":"Sep 2020",
        "end":"Apr 2021",
        "imagePath":"xamarin.png",
        "description":"This project is an Android/iOS application built with the Xamarin mobile platform and C#/.NET framework. It was created by myself and three other team members for our software engineering capstone project at Ball State, in collaboration with Accutech Systems Corporation. My roles included writing unit tests for the business logic, fetching and sending account information to and from the API, and rendering the information in a user friendly format. The GitHub repository can be viewed <a target=\"_blank\" href=\"https://github.com/capstoneconnector/trust-admin-app\">here</a>."
    },
    {
        "id": 3,
        "name":"CS4MS+ Website",
        "institution":"Ball State University",
        "start":"Jan 2021",
        "end":"May 2021",
        "imagePath":"cs4ms.png",
        "description":"This is a project that I worked on during my final semester at Ball State as a member of the Computer Science For Muncie Schools (CS4MS+) team; it is a website that uses HTML, CSS, and PHP. My role consisted of maintaining and modularizing the backend code, fixing compatibility issues and other bugs, updating documentation, adding more standards/resource pages to the website, and deploying the updated project to the production server. The public website can be viewed <a target=\"_blank\" href=\"https://www.cs.bsu.edu/cs4ms/\">here</a> and the GitHub repository <a target=\"_blank\" href=\"https://github.com/dllargent/CS4MS-Website\">here</a>."
    },
    {
        "id": 4,
        "name":"TLS/SSL Research Project",
        "institution":"Ball State University",
        "start":"Oct 2020",
        "end":"Dec 2020",
        "imagePath":"tls_ssl.png",
        "description":"This was a research project that I completed for an undergraduate network security class. The project discusses the mechanisms of TLS/SSL and explores several current and past problems, such as Heartbleed, renegotiation security, and client impersonation attacks. The completed research paper can be viewed <a target=\"_blank\" href=\"/assets/CS447ResearchProject.pdf\">here</a>."
    },
    {
        "id": 5,
        "name":"Tor Network Research Project",
        "institution":"Ball State University",
        "start":"Jan 2021",
        "end":"May 2021",
        "imagePath":"tor.png",
        "description":"This research initiative was conducted in collaboration with Dr. Xin Sun at Ball State. The research project centers around the Tor network, specifically performance issues that  prevent it from scaling to support new users, as well as solutions that can be reached without compromising users' anonymity. The completed research paper can be viewed <a target=\"_blank\" href=\"/assets/CS499TorResearchProject.pdf\">here</a>."
    }
]